"""
Внимательно прочитайте код в этом файле и добавьте свой код везде, где встречается <YOUR CODE>.
Перед каждым заданием вы можете прочитать его описание, помеченное меткой TODO.
для проверки введите из папки с проектом: pytest -vm task_13
"""
from typing import Any, Union, Optional


def find_max_word(text: str) -> str:
    """Находит самое длинное слово в тексте.

    Текст может содержать буквы, цифры, символы пунктуации.
    :param text: разираемый текст
    :return: самое длинное слово
    """
    # TODO: реализовать данную функцию


def bubble_sort(data: list[int]):
    """Сортирует список чисел по возрастанию.
    :param data: список чисел
    :return:
    """

    # TODO: реализовать данную функцию.
    #  Реализовать пузырьковую сортировку.
    #  При реализации запрещено использовать уже реализованные функции поиска или сортировки.


def bin_search(data: list[int], value: int) -> int:
    """Поиск value в заранее отсортированном по возрастанию списке data.

    :param data: отсортированный список значений
    :param value: искомое значение
    :return: индекс элемента или None если не найден элемент
    """

    # TODO: реализовать данную функцию.
    #  Реализовать бинарный поиск.
    #  При реализации запрещено использовать уже реализованные функции поиска или сортировки.
