# TODO:
#  Примечание: все цвета указаны в hex формате
#  0. Создать окно приложения размерами 400х300
#       0.1 Цвет фона окна- #C1C1C1
#  1. Разместить в окне кнопку:
#       1.1 Размеры кнопки - 362х54
#       1.2 Расположить кнопку:
#           1.2.1 по горизонтали - по центру окна приложения
#           1.2.2 по вертикали - в 20 пикселях от нижнего края окна
#       1.3 Цвет фона кнопки - #333E35
#       1.4 Текст кнопки - "Загрузить"
#       1.5 Размер текста кнопки - 24
#       1.5 Цвет текста кнопки - #FFFFFF
#  1. Разместить в окне текстовое поле:
#       1.1 Размеры поля - 362*191
#       1.2 Расположить поле:
#           1.2.1 по горизонтали - по центру окна приложения
#           1.2.2 по вертикали - в 16 пикселях от верхнего края окна
#       1.3 Цвет фона поля - #FFFFFF
#       1.5 Размер текста поля - 14
#       1.5 Цвет текста поля - #000000
#  3. По нажатию на кнопку должен загружаться текст из файла data.txt, лежащего в той же папке, что и ваша программа.
#       3.1 Файл должен содержать несколько строчек текста
#       3.2 Текст файла записывается в текстовое поле из пункта 2
#  https://www.figma.com/file/1VYJqv2EFbgNKBNf3YXh5x/middle_task_4

